README.md

# Table of Contents

1.  [Nome do Software (ou Biblioteca):](#org7698df7)
2.  [Resumo e/ou informação extra:](#org18dcf3b)
3.  [Versão:](#org485c807)
4.  [Data:](#org577be07)
5.  [Autor de Contato:](#org922f52a)
6.  [Lista dos Autores:](#org566b8c1)
7.  [Áreas de pesquisa vinculadas:](#org4b9e3ec)
8.  [Vinculo com:](#org4955ddd)
9.  [Paradigmas:](#orgf70f874)
10. [Tipo de Interface:](#org4e1f968)
11. [Plataformas Suportadas:](#org92e81fb)
12. [Linguagens Utilizadas:](#orge72b892)
13. [Bibliotecas Utilizadas (dependências):](#org679079e)
14. [Softwares utilizados (dependências)](#orgecfbeb0)
15. [Tipo de Licença:](#org88a4db4)
16. [Links:](#orgfed9774)


<a id="org7698df7"></a>

# Nome do Software (ou Biblioteca):

-   Desenvolver um software que calcula as propriedades petrofísicas ao longo do poço a partir de equações da física.


<a id="org18dcf3b"></a>

# Resumo e/ou informação extra:

-   Plotar os perfis.

– Calcular a porosidade.
– Calcular a argilosidade.
– Calcular a saturação de óleo e água.
– Plotar as propriedades calculadas.


<a id="org485c807"></a>

# Versão:

-   1.0.


<a id="org577be07"></a>

# Data:

-   2015/2 - segundo semestre.


<a id="org922f52a"></a>

# Autor de Contato:

-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org566b8c1"></a>

# Lista dos Autores:

-   POLLYANA FERREIRA DA SILVA
-   ÉRICA MELLO LISBÔA
-   André Duarte Bueno <andreduartebueno@gmail.com>


<a id="org4b9e3ec"></a>

# Áreas de pesquisa vinculadas:

-   Modelagem Matemática Computacional
-   Petrofísica


<a id="org4955ddd"></a>

# Vinculo com:

-   Trabalho da disciplina de programação prática.


<a id="orgf70f874"></a>

# Paradigmas:

-   POO - Programação Orientada a Objeto (códigos em C++)


<a id="org4e1f968"></a>

# Tipo de Interface:

-   Terminal e gráfica (gnuplot).


<a id="org92e81fb"></a>

# Plataformas Suportadas:

-   Windows e GNU/Linux e Mac OS X (não testada).


<a id="orge72b892"></a>

# Linguagens Utilizadas:

-   C++ 11.


<a id="org679079e"></a>

# Bibliotecas Utilizadas (dependências):

-   CGnuplot - <https://github.com/ldsc/CGnuplot>


<a id="orgecfbeb0"></a>

# Softwares utilizados (dependências)

-   gnuplot <http://www.gnuplot.info/>


<a id="org88a4db4"></a>

# Tipo de Licença:

-   GPL
-   Entre em contato com o Prof. André Duarte Bueno
    andreduartebueno@gmail.com
    para que o mesmo gere um novo projeto no github do ldsc para que você (e sua equipe) possam trabalhar na nova versão.
-   Se este projeto tem como número de versão 1.0 a nova versão deverá ser 2.0 e assim sucessivamente.
-   Os nomes dos autores originais deve ser preservada na nova versão, ou seja, adicione a informação do número da versão, os nomes dos membros da nova equipe, mas jamais apague os nomes dos autores originais (isto seria plágio).
-   Na descrição do projeto informe que trata-se de uma nova versão, que tem como base a versão anterior e DESTAQUE COM CLAREZA E OBJETIVIDADE QUAIS AS NOVIDADES DA NOVA VERSÃO.


<a id="orgfed9774"></a>

# Links:

